[Rainmeter]
OnWakeAction=[!Log "Awake!"][!UpdateMeasure MeasureInternetConnectivity]
ContextTitle="Auto-location"
ContextAction=[!WriteKeyValue Variables AutoLocation 1 #CoreFilePath#][!WriteKeyValue Variables FirstStep "MeasureZipCode" #CoreFilePath#][!WriteKeyValue Variables WeatherURL "" #CoreFilePath#][!Refresh]
ContextTitle2="Set location	(auto: off)"
ContextAction2=[!ShowMeterGroup LocationOverlay][!SetOption MeasureLocationInput DefaultValue "#Location#"][!SetOption LocationInputOverlay Text "#Location#"][!UpdateMeter LocationInputOverlay][!CommandMeasure MeasureLocationInput "ExecuteBatch All"]
ContextTitle3="-"
ContextTitle4="Imperial units (F)"
ContextAction4=[!SetVariable MetricUnits 0][!WriteKeyValue Variables MetricUnits 0 #CoreFilePath#][!UpdateMeasure MeasureUnits]
ContextTitle5="Metric units (C)"
ContextAction5=[!SetVariable MetricUnits 1][!WriteKeyValue Variables MetricUnits 1 #CoreFilePath#][!UpdateMeasure MeasureUnits]
ContextTitle6="-"
ContextTitle7="12-hour time"
ContextAction7=[!SetVariable 24HourTime 0][!WriteKeyValue Variables 24HourTime 0 #CoreFilePath#][!UpdateMeasure MeasureTimeFormat]
ContextTitle8="24-hour time"
ContextAction8=[!SetVariable 24HourTime 1][!WriteKeyValue Variables 24HourTime 1 #CoreFilePath#][!UpdateMeasure MeasureTimeFormat]
